URLShortener/app/models/ShortenedUrl.rb

  def self.random_code
    random_url = SecureRandom.urlsafe_base64
    while self.exists?(short_url: random_url)
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "sJRRfB4ITlsRZCiAbRcP5g"], ["LIMIT", 1]]