URLShortener/app/models/visit.rb

  def self.record_visit!(user, shortened_url)
    Visit.create!(user_id: user.id, shortened_url_id: shortened_url.id )
---
INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["shortened_url_id", 3], ["created_at", "2020-05-29 17:45:42.070142"], ["updated_at", "2020-05-29 17:45:42.070142"]]